JayHeng/RT-MFB/boards/mimxrt/mfb_fw/src/mfb.c
uint32_t mfb_decode_adesto_capacity_id(uint8_t capacityID)
{
    uint32_t memSizeInBytes = 0;
    //|Adesto QuadSPI      | Adesto QuadSPI EU  |
    //|------------------------------------------
    //|                    | 10h - 1Mb          |
    //| 03h - 2Mb          | 11h - 2Mb          |
    //| 04h - 4Mb          | 14h - 4Mb          |
    //| 05h - 8Mb          |                    |
    //| 06h - 16Mb         |                    |
    //| 07h - 32Mb         |                    |
    //| 08h - 64Mb         |                    |
    //| 09h - 128Mb        |                    |
    if (capacityID <= 0x09)
    {
        capacityID += 15;
    }
    else if (capacityID == 0x10)
    {
        capacityID = 0x11;
    }
    else if (capacityID == 0x11)
    {
        capacityID = 0x12;
    }
    else if (capacityID == 0x14)
    {
        capacityID = 0x13;
    }
    memSizeInBytes = 1 << capacityID;
    return memSizeInBytes;
}

void mfb_show_mem_size(uint8_t capacityID, bool isAdesto)
{
#if MFB_DEBUG_LOG_INFO_ENABLE
    uint32_t flashMemSizeInKB;
    if (isAdesto)
    {
        mfb_printf("MFB: Flash Density Code: 0x%x", capacityID);
        flashMemSizeInKB = mfb_decode_adesto_capacity_id(capacityID)/ 0x400;
    }
    else
    {
        mfb_printf("MFB: Flash Capacity ID: 0x%x", capacityID);
        flashMemSizeInKB = mfb_decode_common_capacity_id(capacityID)/ 0x400;
    }
    if (flashMemSizeInKB <= 0x400)
    {
        mfb_printf(" -- %dKB.\r\n", flashMemSizeInKB);
    }
    else
    {
        mfb_printf(" -- %dMB.\r\n", flashMemSizeInKB / 0x400);
    }
#endif
}

void mfb_main(void)
{
    status_t status;
    uint32_t jedecID = 0;
    uint8_t manufacturerID = 0;
    uint8_t memoryTypeID = 0;
    uint8_t capacityID = 0;

    mfb_printf("MFB: i.MXRT multi-flash boot solution.\r\n");
    cpu_show_clock_source();
    
    /* Init FlexSPI pinmux */
    flexspi_port_switch(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_1PAD);
    flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_1PAD);

    /* Move FlexSPI clock to a stable clock source */ 
    flexspi_clock_init(EXAMPLE_FLEXSPI, kFlexspiRootClkFreq_30MHz);
    /* Init FlexSPI using common LUT */ 
    flexspi_nor_flash_init(EXAMPLE_FLEXSPI, customLUTCommonMode, kFLEXSPI_ReadSampleClkLoopbackInternally);
    mfb_printf("\r\nMFB: FLEXSPI module is initialized to 1bit SDR normal read mode.\r\n");
    flexspi_show_clock_source(EXAMPLE_FLEXSPI);

    /* Get JEDEC ID. */
#if MFB_FLASH_FAKE_JEDEC_ID_ENABLE
    jedecID = MICRON_OCTAL_FLASH_JEDEC_ID;
#else
    status = flexspi_nor_get_jedec_id(EXAMPLE_FLEXSPI, &jedecID);
    if (status != kStatus_Success)
    {
        mfb_printf("MFB: Get Flash Vendor ID failed.\r\n");
    }
    else
#endif
    {
        bool isOctalFlash = false;
        bool isValidVendorId = true;
        bool isValidPattern = false;
        bool fillPatternWhenFailure = true;
        bool isAdestoDevice = false;
        uint8_t dummyValue = 0;
        manufacturerID = jedecID & 0xFF;
        memoryTypeID = (jedecID >> 8) & 0xFF;
        capacityID = (jedecID >> 16) & 0xFF;
        uint32_t flashMemSizeInByte = mfb_decode_common_capacity_id(capacityID);
        isValidPattern = mfb_flash_pattern_verify_test(false);
        mfb_flash_memcpy_perf_test(true);
        mfb_printf("MFB: Flash Manufacturer ID: 0x%x", manufacturerID);
        switch (manufacturerID)
        {
#if MXIC_DEVICE_SERIES
            // MXIC
            case 0xc2:
                {
                    mfb_printf(" -- MXIC Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", memoryTypeID);
                    switch (memoryTypeID)
                    {
                        case 0x20:
                            mfb_printf(" -- MX25L/MX66L/MX25V QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x25:
                            mfb_printf(" -- MX25U/MX66U QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x28:
                            mfb_printf(" -- MX25R QuadSPI 1.8-3.3V Series.\r\n");
                            break;
                        case 0x75:
                            mfb_printf(" -- MX77L QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x80:
                            isOctalFlash = true;
                            mfb_printf(" -- MX25UM/MX66UM OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x81:
                            isOctalFlash = true;
                            mfb_printf(" -- MX25UM51345G OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x83:
                            isOctalFlash = true;
                            mfb_printf(" -- MX25UM25345G OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x84:
                            isOctalFlash = true;
                            mfb_printf(" -- MX25UW51345G OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x85:
                            isOctalFlash = true;
                            mfb_printf(" -- MX25LM/MX66LM OctalSPI 3.3V Series.\r\n");
                            break;
                        // Missing MX25LW51245G, MX66LW1G45G, MX66LW2G45G
                        // Missing MX25UW6445G, MX66UW12845G, MX25UW25645G, MX25UW51245G, MX66UW1G45G, MX66UW2G45G
                        // Missing MX25UW6345G, MX66LW12345G, MX66UW25345G      done                 , MX66UW2G345G
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(capacityID, isAdestoDevice);
#if MXIC_DEVICE_MX25UM51345
                    if (isOctalFlash)
                    {
                        flexspi_root_clk_freq_t rootClkFreq = kFlexspiRootClkFreq_100MHz;
                        flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_8PAD);
                        flexspi_clock_init(EXAMPLE_FLEXSPI, rootClkFreq);
                        /* Update root clock */
                        deviceconfig.flexspiRootClk = flexspi_get_clock(EXAMPLE_FLEXSPI);
                        deviceconfig.flashSize = flashMemSizeInByte / 0x400;
                        s_flashBusyStatusPol    = MXIC_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = MXIC_FLASH_BUSY_STATUS_OFFSET;
                        s_flashEnableOctalCmd   = MXIC_OCTAL_FLASH_ENABLE_DDR_CMD;
                        /* Re-init FlexSPI using custom LUT */
                        flexspi_nor_flash_init(EXAMPLE_FLEXSPI, customLUT_MXIC_Octal, kFLEXSPI_ReadSampleClkExternalInputFromDqsPad);
                        // Set dummy cycle of Flash
                        if (rootClkFreq == kFlexspiRootClkFreq_200MHz)
                        {
                            dummyValue = MXIC_OCTAL_FLASH_SET_DUMMY_CMD;
                            flexspi_nor_set_dummy_cycle(EXAMPLE_FLEXSPI, MXIC_OCTAL_FLASH_SET_DUMMY_CMD);
                        }
                        /* Enter octal mode. */
                        status = flexspi_nor_enable_octal_mode(EXAMPLE_FLEXSPI);
                    }
#endif
                    break;
                }
#endif // MXIC_DEVICE_SERIES

