JayHeng/RT-MFB/boards/mimxrt/mfb_fw/src/mfb.c
#if ISSI_DEVICE_SERIES
            // ISSI
            case 0x9d:
                {
                    mfb_printf(" -- ISSI Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", memoryTypeID);
                    switch (memoryTypeID)
                    {
                        case 0x40:
                            mfb_printf(" -- IS25LQ/IS25LP QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x60:
                            mfb_printf(" -- IS25LP/IS25LE QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x70:
                            mfb_printf(" -- IS25WP/IS25WJ/IS25WE QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x5A:
                            isOctalFlash = true;
                            mfb_printf(" -- IS25LX OctalSPI 3.3V Series.\r\n");
                            break;
                        case 0x5B:
                            isOctalFlash = true;
                            mfb_printf(" -- IS25WX OctalSPI 1.8V Series.\r\n");
                            break;
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(capacityID, isAdestoDevice);
#if ISSI_DEVICE_IS25WP064A
                    if (!isOctalFlash)
                    {
                        flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_4PAD);
                        flexspi_clock_init(EXAMPLE_FLEXSPI, kFlexspiRootClkFreq_100MHz);
                        /* Update root clock */
                        deviceconfig.flexspiRootClk = flexspi_get_clock(EXAMPLE_FLEXSPI);
                        deviceconfig.flashSize = flashMemSizeInByte / 0x400;
                        s_flashBusyStatusPol    = ISSI_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = ISSI_FLASH_BUSY_STATUS_OFFSET;
                        s_flashQuadEnableCfg    = ISSI_FLASH_QUAD_ENABLE;
                        /* Re-init FlexSPI using custom LUT */
                        flexspi_nor_flash_init(EXAMPLE_FLEXSPI, customLUT_ISSI_Quad, kFLEXSPI_ReadSampleClkLoopbackFromDqsPad);
                        /* Enter quad mode. */
                        status = flexspi_nor_enable_quad_mode(EXAMPLE_FLEXSPI);
                    }
#endif
#if ISSI_DEVICE_IS25WX256
                    if (isOctalFlash)
                    {
                        s_flashBusyStatusPol    = ISSI_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = ISSI_FLASH_BUSY_STATUS_OFFSET;
                        if (!isValidPattern)
                        {
                            if (!mfb_flash_pattern_verify_test(true))
                            {
                                return;
                            }
                        }
                        fillPatternWhenFailure = false;
#if MFB_FLASH_FORCE_LOOPBACK_DQS
                        flexspi_root_clk_freq_t rootClkFreq = kFlexspiRootClkFreq_30MHz;
#else
                        flexspi_root_clk_freq_t rootClkFreq = kFlexspiRootClkFreq_166MHz;
#endif
                        flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_8PAD);
                        flexspi_clock_init(EXAMPLE_FLEXSPI, rootClkFreq);
                        /* Update root clock */
                        deviceconfig.flexspiRootClk = flexspi_get_clock(EXAMPLE_FLEXSPI);
                        deviceconfig.flashSize = flashMemSizeInByte / 0x400;
                        s_flashEnableOctalCmd   = ISSI_OCTAL_FLASH_ENABLE_DDR_CMD;
                        /* Re-init FlexSPI using custom LUT */
#if MFB_FLASH_FORCE_LOOPBACK_DQS
                        flexspi_nor_flash_init(EXAMPLE_FLEXSPI, customLUT_ISSI_Octal, kFLEXSPI_ReadSampleClkLoopbackFromDqsPad);
#else
                        flexspi_nor_flash_init(EXAMPLE_FLEXSPI, customLUT_ISSI_Octal, kFLEXSPI_ReadSampleClkExternalInputFromDqsPad);
                        // Set dummy cycle of Flash
                        if (rootClkFreq == kFlexspiRootClkFreq_200MHz)
#endif
                        {
                            dummyValue = ISSI_OCTAL_FLASH_SET_DUMMY_CMD;
                            flexspi_nor_set_dummy_cycle(EXAMPLE_FLEXSPI, ISSI_OCTAL_FLASH_SET_DUMMY_CMD);
                        }
                        /* Enter octal mode. */
#if !MFB_FLASH_FORCE_LOOPBACK_DQS
                        status = flexspi_nor_enable_octal_mode(EXAMPLE_FLEXSPI);
#endif
                    }
#endif
                    break;
                }
#endif // ISSI_DEVICE_SERIES

#if WINBOND_DEVICE_SERIES
            // Winbond
            case 0xef:
                {
                    mfb_printf(" -- Winbond Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", memoryTypeID);
                    switch (memoryTypeID)
                    {
                        case 0x30:
                            mfb_printf(" -- W25X DualSPI 3.3V Series.\r\n");
                            break;
                        case 0x40:
                            mfb_printf(" -- W25QxxxDV/FV/BV/CL/JV(-IQ/JQ) QuadlSPI 3.3V Series.\r\n");
                            break;
                        case 0x60:
                            mfb_printf(" -- W25QxxxFW/EW/NW(-IQ/IN) QuadlSPI 1.8V Series.\r\n");
                            break;
                        case 0x70:
                            mfb_printf(" -- W25QxxxJV(-IM/JM) QuadlSPI 3.3V Series.\r\n");
                            break;
                        case 0x80:
                            mfb_printf(" -- W25QxxxJW/NW(-IM) QuadlSPI 1.8V Series.\r\n");
                            break;
                        // Missing W25H, W25M, W25R
                        // Missing xxxJL, xxxDW, xxxRV
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(capacityID, isAdestoDevice);
#if WINBOND_DEVICE_W25Q128JW
                    if (!isOctalFlash)
                    {
                        flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_4PAD);
                        flexspi_clock_init(EXAMPLE_FLEXSPI, kFlexspiRootClkFreq_133MHz);
                        /* Update root clock */
                        deviceconfig.flexspiRootClk = flexspi_get_clock(EXAMPLE_FLEXSPI);
                        deviceconfig.flashSize = flashMemSizeInByte / 0x400;
                        s_flashBusyStatusPol    = WINBOND_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = WINBOND_FLASH_BUSY_STATUS_OFFSET;
                        s_flashQuadEnableCfg    = WINBOND_FLASH_QUAD_ENABLE;
                        /* Re-init FlexSPI using custom LUT */
                        flexspi_nor_flash_init(EXAMPLE_FLEXSPI, customLUT_WINBOND_Quad, kFLEXSPI_ReadSampleClkLoopbackFromDqsPad);
                        /* Enter quad mode. */
                        status = flexspi_nor_enable_quad_mode(EXAMPLE_FLEXSPI);
                    }
#endif
                    break;
                }
#endif // WINBOND_DEVICE_SERIES

